_Rarzrabotki/Kazna/InformationRegisters/НастройкиЗагрузкиСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>НастройкиЗагрузкиСчетов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Справочник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Kazna/InformationRegisters/НастройкиЗагрузкиСчетов/Ext/ManagerModule.bsl
Функция ПолучитьСоответствие(ИмяСправочника, Подразделение) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НастройкиЗагрузкиСчетов.Ключ,
	|	НастройкиЗагрузкиСчетов.Значение
	|ИЗ
	|	РегистрСведений.НастройкиЗагрузкиСчетов КАК НастройкиЗагрузкиСчетов
	|ГДЕ
	|	НастройкиЗагрузкиСчетов.Справочник = &Справочник
	|	И НастройкиЗагрузкиСчетов.Подразделение = &Подразделение"
	);
	Запрос.УстановитьПараметр("Справочник", ИмяСправочника);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Результат = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Ключ, Выборка.Значение);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьЗначениеПоКлючу(ИмяСправочника, Подразделение, Ключ) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НастройкиЗагрузкиСчетов.Ключ,
	|	НастройкиЗагрузкиСчетов.Значение
	|ИЗ
	|	РегистрСведений.НастройкиЗагрузкиСчетов КАК НастройкиЗагрузкиСчетов
	|ГДЕ
	|	НастройкиЗагрузкиСчетов.Справочник = &Справочник
	|	И НастройкиЗагрузкиСчетов.Ключ = &Ключ
	|	И НастройкиЗагрузкиСчетов.Подразделение = &Подразделение"
	);	
	Запрос.УстановитьПараметр("Справочник", ИмяСправочника);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Ключ", Ключ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	КонецЕсли; 
	
	Возврат Неопределено;
	
КонецФункции

Процедура СохранитьЗначениеПоКлючу(ИмяСправочника, Подразделение, Ключ, Значение) Экспорт
	
	Запись = РегистрыСведений.НастройкиЗагрузкиСчетов.СоздатьМенеджерЗаписи();
	Запись.Подразделение = Подразделение;
	Запись.Справочник = ИмяСправочника;
	Запись.Ключ = Ключ;
	Запись.Значение = Значение;
	Запись.Записать();
	
КонецПроцедуры
